Revit 2027 API
OrdinateDimensionSetting.OriginVisibility Property
 Specifies thevisibility of the origin witness line for the ordinate dimension (this is the first witness line in the string).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public OrdinateOriginVisibility OriginVisibility { get; set; }
Public Property OriginVisibility As OrdinateOriginVisibility
	Get
	Set
public:
property OrdinateOriginVisibility OriginVisibility {
	OrdinateOriginVisibility get ();
	void set (OrdinateOriginVisibility value);
}
member OriginVisibility : OrdinateOriginVisibility with get, set
Property Value
OrdinateOriginVisibility
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
OrdinateDimensionSetting Class
Autodesk.Revit.DB Namespace